"""
Manipulation des champs str

Éditeur : Laurent REYNAUD
Date : 10-07-221
"""

In [23]:
import pandas as pd

In [24]:
"Récupération du fichier titanic.csv"

titanic = pd.read_csv('data/titanic.csv')
titanic.head(8)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

In [25]:
"Méthode str.lower()"

# Nom des passagers en minuscule
titanic['Name'].str.lower()

0                                braund, mr. owen harris
1      cumings, mrs. john bradley (florence briggs th...
2                                 heikkinen, miss. laina
3           futrelle, mrs. jacques heath (lily may peel)
4                               allen, mr. william henry
                             ...
886                                montvila, rev. juozas
887                         graham, miss. margaret edith
888             johnston, miss. catherine helen "carrie"
889                                behr, mr. karl howell
890                                  dooley, mr. patrick
Name: Name, Length: 891, dtype: object

In [26]:
"Méthode str.split()"

# Séparation du champ nom avec la ',' qui va constitué deux composants pour chaque index
titanic['Name'].str.split(',')

0                             [Braund,  Mr. Owen Harris]
1      [Cumings,  Mrs. John Bradley (Florence Briggs ...
2                              [Heikkinen,  Miss. Laina]
3        [Futrelle,  Mrs. Jacques Heath (Lily May Peel)]
4                            [Allen,  Mr. William Henry]
                             ...
886                             [Montvila,  Rev. Juozas]
887                      [Graham,  Miss. Margaret Edith]
888          [Johnston,  Miss. Catherine Helen "Carrie"]
889                             [Behr,  Mr. Karl Howell]
890                               [Dooley,  Mr. Patrick]
Name: Name, Length: 891, dtype: object

In [27]:
"Méthode str.split()"

# Création d'un nouveau champ prenant en compte que le composant n° 0 des données ci-avant
titanic['Surname'] = titanic['Name'].str.split(',').str.get(0)
titanic['Surname']

0         Braund
1        Cumings
2      Heikkinen
3       Futrelle
4          Allen
         ...
886     Montvila
887       Graham
888     Johnston
889         Behr
890       Dooley
Name: Surname, Length: 891, dtype: object

In [28]:
"Méthode str.contains()"

# Noms comprenant le mot 'Countess' (= Comtesse)
titanic['Name'].str.contains('Countess')

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Name, Length: 891, dtype: bool

In [29]:
"Méthode str.contains()"

# J'insiste ! je veux qu'on me sorte les noms concernés !
titanic[titanic['Name'].str.contains('Countess')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname
759,760,1,1,"Rothes, the Countess. of (Lucy Noel Martha Dye...",female,33.0,0,0,110152,86.5,B77,S,Rothes

In [30]:
"Méthode str.len()"

# Nombre de caractère de chaque nom des passagers
titanic['Name'].str.len()

0      23
1      51
2      22
3      44
4      24
       ..
886    21
887    28
888    40
889    21
890    19
Name: Name, Length: 891, dtype: int64

In [31]:
"Méthodes str.len() et idxmax()"

# Nombre de caractères du nom le plus long
titanic.loc[titanic['Name'].str.len().idxmax()]

PassengerId                                                  308
Survived                                                       1
Pclass                                                         1
Name           Penasco y Castellana, Mrs. Victor de Satode (M...
Sex                                                       female
Age                                                         17.0
SibSp                                                          1
Parch                                                          0
Ticket                                                  PC 17758
Fare                                                       108.9
Cabin                                                        C65
Embarked                                                       C
Surname                                     Penasco y Castellana
Name: 307, dtype: object

In [32]:
"Méthodes str.len() et idxmax()"

# Nom correspondant
titanic.loc[titanic['Name'].str.len().idxmax(), 'Name']

'Penasco y Castellana, Mrs. Victor de Satode (Maria Josefa Perez de Soto y Vallejo)'

In [33]:
"Méthode str.replace()"

# Modification des données du champ 'Sex' en ajoutant une nouvelle colonne
titanic['Sex short'] = titanic['Sex'].str.replace('female', 'F')
titanic['Sex short'] = titanic['Sex short'].str.replace('male', 'M')
titanic['Sex short']

0      M
1      F
2      F
3      F
4      M
      ..
886    M
887    F
888    F
889    M
890    M
Name: Sex short, Length: 891, dtype: object